zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_ll_fmc.c
  /* Set the FMC_NAND_BANK3 registers to their reset values */
  WRITE_REG(Device->PCR,  0x0007FE08U);
  WRITE_REG(Device->SR,   0x00000053U);
  WRITE_REG(Device->PMEM, 0x0A0A0A0AU);
  WRITE_REG(Device->PATT, 0x0A0A0A0AU);

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup HAL_FMC_NAND_Group2 Peripheral Control functions
  *  @brief   management functions
  *
@verbatim
  ==============================================================================
                       ##### FMC_NAND Control functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to control dynamically
    the FMC NAND interface.

@endverbatim
  * @{
  */


/**
  * @brief  Enables dynamically FMC_NAND ECC feature.
  * @param  Device Pointer to NAND device instance
  * @param  Bank NAND bank number
  * @retval HAL status
  */
HAL_StatusTypeDef FMC_NAND_ECC_Enable(FMC_NAND_TypeDef *Device, uint32_t Bank)
{
  /* Prevent unused argument(s) compilation warning if no assert_param check */
  UNUSED(Bank);

  /* Check the parameters */
  assert_param(IS_FMC_NAND_DEVICE(Device));
  assert_param(IS_FMC_NAND_BANK(Bank));

  /* Enable ECC feature */
  __FMC_NAND_ENABLE_ECC(Device, Bank);

  return HAL_OK;
}


/**
  * @brief  Disables dynamically FMC_NAND ECC feature.
  * @param  Device Pointer to NAND device instance
  * @param  Bank NAND bank number
  * @retval HAL status
  */
HAL_StatusTypeDef FMC_NAND_ECC_Disable(FMC_NAND_TypeDef *Device, uint32_t Bank)
{
  /* Prevent unused argument(s) compilation warning if no assert_param check */
  UNUSED(Bank);

  /* Check the parameters */
  assert_param(IS_FMC_NAND_DEVICE(Device));
  assert_param(IS_FMC_NAND_BANK(Bank));

  /* Disable ECC feature */
  __FMC_NAND_DISABLE_ECC(Device, Bank);

  return HAL_OK;
}

/**
  * @brief  Gets computed Hamming ECC value.
  * @param  Device Pointer to NAND device instance
  * @param  ECCval Pointer to ECC value
  * @param  Bank NAND bank number
  * @param  Timeout Timeout wait value
  * @retval HAL status
  */
HAL_StatusTypeDef FMC_NAND_GetECC(FMC_NAND_TypeDef *Device, uint32_t *ECCval, uint32_t Bank,
                                  uint32_t Timeout)
{
  uint32_t tickstart;

  /* Check the parameters */
  assert_param(IS_FMC_NAND_DEVICE(Device));
  assert_param(IS_FMC_NAND_BANK(Bank));

  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait until ECC is ready */
  while (__FMC_NAND_IS_ECC_HAMMING_READY(Device) == RESET)
  {
    /* Check for the Timeout */
    if (Timeout != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
      {
        return HAL_TIMEOUT;
      }
    }
  }

  /* Prevent unused argument(s) compilation warning if no assert_param check */
  UNUSED(Bank);

  /* Get the ECCR register value */
  *ECCval = (uint32_t)Device->HECCR;

  return HAL_OK;
}

/**
  * @brief  Sets dynamically the ECC algorithm.
  * @param  Device Pointer to NAND device instance
  * @param  Algorithm Algorithm to use for the ECC: FMC_NAND_ECC_ALGO_HAMMING or FMC_NAND_ECC_ALGO_BCH
  * @retval HAL status
  */
HAL_StatusTypeDef FMC_NAND_ECC_SetAlgorithm(FMC_NAND_TypeDef *Device, uint32_t Algorithm)
{
  /* Check the parameters */
  assert_param(IS_FMC_NAND_DEVICE(Device));
  assert_param(IS_FMC_ECC_ALGORITHM(Algorithm));

  /* Change the algorithm */
  __FMC_NAND_SET_ECC_ALGORITHM(Device, Algorithm);

  return HAL_OK;
}

/**
  * @brief  Sets dynamically the ECC access mode.
  * @param  Device Pointer to NAND device instance
  * @param  Mode Access mode to use for the sequencer and BCH ECC:
  *               FMC_NAND_ECC_ACCESS_MODE_READ or FMC_NAND_ECC_ACCESS_MODE_WRITE
  * @retval HAL status
  */
HAL_StatusTypeDef  FMC_NAND_ECC_SetAccessMode(FMC_NAND_TypeDef *Device, uint32_t Mode)
{
  /* Check the parameters */
  assert_param(IS_FMC_NAND_DEVICE(Device));
  assert_param(IS_FMC_ECC_ACCESS_MODE(Mode));

  /* Change the access mode */
  __FMC_NAND_SET_ECC_ACCESS_MODE(Device, Mode);

  return HAL_OK;
}

/**
  * @brief  Sets dynamically the BCH mode.
  * @param  Device Pointer to NAND device instance
  * @param  Mode BCH ECC mode: FMC_NAND_BCH_MODE_4BIT or FMC_NAND_BCH_MODE_8BIT
  * @retval HAL status
  */
HAL_StatusTypeDef  FMC_NAND_ECC_SetBCHMode(FMC_NAND_TypeDef *Device, uint32_t Mode)
{
  /* Check the parameters */
  assert_param(IS_FMC_NAND_DEVICE(Device));
  assert_param(IS_FMC_BCH_MODE(Mode));

  /* Change the BCH mode */
  __FMC_NAND_SET_BCH_MODE(Device, Mode);

  return HAL_OK;
}

/**
  * @brief  Gets the BCH ECC value that was computed while writing.
  * @param  Device Pointer to NAND device instance
  * @param  ECCval Pointer to ECC value
  * @param  Timeout Timeout wait value
  * @retval HAL status
  */
HAL_StatusTypeDef FMC_NAND_ECC_GetBCH(FMC_NAND_TypeDef *Device, uint32_t *ECCval, uint32_t Timeout)
{
  uint32_t tickstart;

  /* Check the parameters */
  assert_param(IS_FMC_NAND_DEVICE(Device));

  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait until ECC is ready */
  while (__FMC_NAND_IS_ECC_BCH_ENCODER_READY(Device) == RESET)
  {
    /* Check for the Timeout */
    if (Timeout != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
      {
        return HAL_TIMEOUT;
      }
    }
  }

  /* Get the BCHPBRx registers value */
  ECCval[0] = Device->BCHPBR1;
  ECCval[1] = Device->BCHPBR2;
  ECCval[2] = Device->BCHPBR3;
  ECCval[3] = Device->BCHPBR4;

  return HAL_OK;
}

/**
  * @brief  Gets the BCH result registers after reading a sector.
  * @param  Device Pointer to NAND device instance
  * @param  BCHDSRx Pointer to an array of 5 values containing the five BCHDSRx registers
  * @param  Timeout Timeout wait value
  * @retval HAL status
  */
HAL_StatusTypeDef FMC_NAND_ECC_GetBCHResult(FMC_NAND_TypeDef *Device, uint32_t *BCHDSRx,
                                                     uint32_t Timeout)
{
  uint32_t tickstart;

  /* Check the parameters */
  assert_param(IS_FMC_NAND_DEVICE(Device));

  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait until ECC is ready */
  while (__FMC_NAND_IS_ECC_BCH_DECODER_READY(Device) == RESET)
  {
    /* Check for the Timeout */
    if (Timeout != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
      {
        return HAL_TIMEOUT;
      }
    }
  }

  if (__FMC_NAND_IS_ECC_BCH_DECODER_READY(Device) == SET)
  {
	  Device->BCHICR |= FMC_BCHISR_DERF;
  }

