zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_ll_fmc.c
  /* Get the BCHPBRx registers value */
  BCHDSRx[0] = Device->BCHDSR0;
  BCHDSRx[1] = Device->BCHDSR1;
  BCHDSRx[2] = Device->BCHDSR2;
  BCHDSRx[3] = Device->BCHDSR3;
  BCHDSRx[4] = Device->BCHDSR4;

  return HAL_OK;
}

/**
  * @brief  Gets the bit positions where an error occurred while reading.
  * After the call:
  * - If no error was found, ErrorCount is set to 0
  * - If too many errors were found (more than 4 or 8 depending of BCH configuration), ErrorCount is set to -1
  * - Otherwise ErrorCount is set to the number of errors found (up to 8), and Positions if filled with the error
  *   positions
  * @param  BCHDSRx Pointer to an array of 5 values containing the five BCHDSRx registers
  * @param  Positions Pointer to an array of up to 8 error positions
  * @param  ErrorCount Pointer to a value giving the number of errors
  */
void FMC_NAND_ECC_DecodeBCHResult(const uint32_t *BCHDSRx, uint16_t *Positions, int32_t *ErrorCount)
{
  uint32_t BCHDSR = BCHDSRx[0];
  if ((BCHDSR & FMC_BCHDSR0_DEF) == 0U)
  {
    /* There is no error */
    *ErrorCount = 0;
  }
  else if ((BCHDSR & FMC_BCHDSR0_DUE) != 0U)
  {
    /* There are too many errors, they cannot be corrected */
    *ErrorCount = -1;
  }
  else
  {
    /* There are some correctable errors */
    BCHDSR = (BCHDSR & FMC_BCHDSR0_DEN_Msk) >> FMC_BCHDSR0_DEN_Pos;
    *ErrorCount = (int32_t)BCHDSR;
    BCHDSR = BCHDSRx[1];
    Positions[0] = (uint16_t)(BCHDSR & 0x1fffU);
    Positions[1] = (uint16_t)((BCHDSR >> 16) & 0x1fffU);
    BCHDSR = BCHDSRx[2];
    Positions[2] = (uint16_t)(BCHDSR & 0x1fffU);
    Positions[3] = (uint16_t)((BCHDSR >> 16) & 0x1fffU);
    BCHDSR = BCHDSRx[3];
    Positions[4] = (uint16_t)(BCHDSR & 0x1fffU);
    Positions[5] = (uint16_t)((BCHDSR >> 16) & 0x1fffU);
    BCHDSR = BCHDSRx[4];
    Positions[6] = (uint16_t)(BCHDSR & 0x1fffU);
    Positions[7] = (uint16_t)((BCHDSR >> 16) & 0x1fffU);
  }
}

/**
  * @}
  */



/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_NOR_MODULE_ENABLED */
/**
  * @}
  */
/**
  * @}
  */
